{"/docs/create/":{"data":{"":"create_pdf.py is a CLI tool that layouts your card images into a printable PDF. Then, you can cut out the cards with the appropriate cutting template in cutting_templates/.","basic-usage#Basic Usage":"Create a Python virtual environment python -m venv venv Activate the Python virtual environment macOS/LinuxWindows . venv/bin/activate .\\venv\\Scripts\\Activate.ps1 Note\nYou may see a security error. If you do, run the following, then try activating the environment again.\nSet-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope Process Prepare images Put your front images in game/front.\nPut your back image in game/back.\nRun the script python create_pdf.py Get your PDF at game/output/game.pdf.","cli-options#CLI Options":" Usage: create_pdf.py [OPTIONS] Options: --front_dir_path TEXT The path to the directory containing the card fronts. [default: game/front] --back_dir_path TEXT The path to the directory containing one or no card backs. [default: game/back] --double_sided_dir_path TEXT The path to the directory containing card backs for double-sided cards. [default: game/double_sided] --output_pdf_path TEXT The desired path to the output PDF. [default: game/output/game.pdf] --card_size [standard|japanese|poker|poker_half|bridge] The desired card size. [default: standard] --paper_size [letter|a4] The desired paper size. [default: letter] --front_registration Enable the front pages to have Print \u0026 Play (registration marks). --only_fronts Only use the card fronts, exclude the card backs. --crop FLOAT RANGE Crop a percentage of the outer portion of front and double-sided images, useful for existing print bleed. [0\u003c=x\u003c=100] --extend_corners INTEGER RANGE Reduce artifacts produced by rounded corners in card images. [default: 0; x\u003e=0] --load_offset Apply saved offsets. See `offset_pdf.py` for more information. --name TEXT Label each page of the PDF with a name. --help Show this message and exit. ","double-sided-cards#Double-Sided Cards":"To create double-sided cards, put front images in game/front and back images in game/double_sided. The filenames must match for each pair.","examples#Examples":"Put the registration marks on the front side, instead of back side.\npython create_pdf.py --front_registration Put the registration marks on the front side and do not generate the back side. This combo is useful if you want to make stickers or save ink by making cards without backs.\npython create_pdf.py --front_registration --only_fronts Create poker-sized cards with A4 sized paper.\npython create_pdf.py --card_size poker --paper_size a4 Crop the borders of the front and double-sided images. This option is useful if your images already have print bleed.\npython create_pdf.py --crop 6.5 Remove the white corners from the PDF and load the saved offset from offset_pdf.py.\npython create_pdf.py --extend_corners 10 --load_offset ","plugins#Plugins":"Plugins streamline the process for acquiring card image for various games.\nThe MTG plugin is currently available, which can automatically acquire card images based on a decklist. Various decklist formats are supported, including MTGA, MTGO, Archidekt, Deckstats, and Moxfield. To learn more, see here.","white-corners#White Corners":"If your card images have rounded corners, they may be missing print bleed in the PDF. You may have seen white Xs appear in your PDF; these are artifacts from rounded corners. Because of the missing print bleed, when these cards are cut, they may have a sliver of white on the corners.\nThe --extend_corners option can ameliorate this issue. You may need to experiment with the value but I recommend starting with 10\npython create_pdf.py --extend_corners 10 "},"title":"create_pdf.py"},"/docs/offset/":{"data":{"":"It’s pivotal to ensure that your the fronts and backs are aligned. However, it’s not always possible to calibrate a printer.\noffset_pdf.py is a CLI tool that adds an offset to every other page in a PDF, i.e. all the back pages. This offset can compensate for the natural offset from your printer.","basic-usage#Basic Usage":"First, you must determine the offset by using assets/calibration.pdf.\ncalibration.pdf has a front page and a back page.\nThe front page is a simple grid of squares.\nThe back page is the same grid of squares, except each square has a slight offset. The following grid illustrates the applied offsets.\n| (-2, -2) | (-1, -2) | ( 0, -2) | ( 1, -2) | ( 2, -2) | -------------------------------------------------------- | (-2, -1) | (-1, -1) | ( 0, -1) | ( 1, -1) | ( 2, -1) | -------------------------------------------------------- | (-2, 0) | (-1, 0) | Center | ( 1, 0) | ( 2, 0) | -------------------------------------------------------- | (-2, 1) | (-1, 1) | ( 0, 1) | ( 1, 1) | ( 2, 1) | -------------------------------------------------------- | (-2, 2) | (-1, 2) | ( 0, 2) | ( 1, 2) | ( 2, 2) | To figure out the required offset, print out calibration.pdf with the card stock you plan to use.\nShine a strong light on the front so you can see the shadows on the back. Determine the square such that the front square and the back square are aligned with each other. This square will provide your offset. Now, you can use offset_pdf.py to apply the appropriate offset to your PDF.\nCreate and start your virtual Python environment and install Python dependencies if you have not done so already. See here for more information.\nRun the script.\npython offset_pdf.py --x_offset -5 --y_offset 10 Get your offset PDF at game/output/game_offset.pdf.","cli-options#CLI Options":" Usage: offset_pdf.py [OPTIONS] Options: --pdf_path TEXT The path of the input PDF. --output_pdf_path TEXT The desired path of the offset PDF. -x, --x_offset INTEGER The desired offset in the x-axis. -y, --y_offset INTEGER The desired offset in the y-axis. -s, --save Save the x and y offset values. --help Show this message and exit. ","save-offset#Save Offset":"You can save your x and y offset with the --save option. After saving your offset, it’ll be automatically applied every time you run offset_pdf.py. You can override the loaded offset using --x_offset and --y_offset.\npython offset_pdf.py --x_offset -5 --y_offset 10 --save Additionally, you can automatically apply a saved offset in create_pdf.py by using the --load_offset option.\npython create_pdf.py --load_offset "},"title":"offset_pdf.py"},"/plugins/":{"data":{"":"Plugins streamline the process for acquiring card images for various games.\nThe following plugins are currently available:\nMagic: The Gathering "},"title":"Plugins"},"/plugins/mtg/":{"data":{"":"This plugin reads a decklist and automatically fetches the card art and puts them in the proper game/ directories.\nThis plugin supports many decklist formats such as, simple, mtga, mtgo, archidekt, deckstats, and moxfield. To learn more, see here.","basic-instructions#Basic instructions":"Navigate to the root directory. This plugin is not meant to be run in plugins/mtg/.\nIf you’re on macOS or Linux, open Terminal. If you’re on Windows, open PowerShell.\nCreate and start your virtual Python environment and install Python dependencies if you have not done so already. See here for more information.\nPut your decklist into a text file in game/decklist. In this example, the filename is deck.txt and the decklist format is MTG Arena (mtga).\nRun the script.\npython plugins/mtg/fetch.py game/decklist/deck.txt mtga Now you can create the PDF using create_pdf.py.","cli-options#CLI Options":" Usage: fetch.py [OPTIONS] DECK_PATH {simple|mtga|mtgo|archidekt|deckstats|moxfield} Options: -i, --ignore_set_and_collector_number Ignore provided sets and collector numbers when fetching cards. --prefer_older_sets Prefer fetching cards from older sets if sets are not provided. -s, --prefer_set TEXT Prefer fetching cards from a particular set(s) if sets are not provided. Use this option multiple times to specify multiple preferred sets. --prefer_showcase Prefer fetching cards with showcase treatment --prefer_extra_art Prefer fetching cards with full art, borderless, or extended art. --help Show this message and exit. Examples Use a Moxfield decklist named my_decklist.txt.\npython plugins/mtg/fetch.py game/decklist/my_decklist.txt moxfield Use a Moxfield decklist named my_decklist.txt and ignore all the provided sets and collector numbers. Instead, get the latest normal versions of these cards (not showcase or full/borderless/extended art).\npython plugins/mtg/fetch.py game/decklist/my_decklist.txt moxfield -i Use a Moxfield decklist named my_decklist.txt and ignore all the provided sets and collector numbers. Instead, get the latest full, borderless, or extended art for all cards when possible.\npython plugins/mtg/fetch.py game/decklist/my_decklist.txt moxfield -i --prefer_extra_art Use an MTG Online decklist named old_school.txt and ignore all the provided sets and collector numbers. Instead, get the latest oldest normal versions of these cards (not showcase or full/borderless/extended art).\npython plugins/mtg/fetch.py game/decklist/old_school.txt mtgo -i --prefer_older_sets Use a Deckstats decklist named eldraine_commander.txt. Use the set and collector numbers when provided. If not, get art from the Eldraine (ELD) and Wilds of Eldraine (WOE) expansions when possible.\npython plugins/mtg/fetch.py game/decklist/eldraine_commander.txt deckstats -s eld -s woe ","formats#Formats":"simple: A list of card names.\nIsshin, Two Heavens as One Arid Mesa Battlefield Forge Blazemire Verge Blightstep Pathway mtga: Magic: The Gathering Arena format.\nAbout Name Death \u0026 Taxes Companion 1 Yorion, Sky Nomad Deck 2 Arid Mesa 1 Lion Sash 1 Loran of the Third Path 2 Witch Enchanter mtgo: Magic: The Gathering Online format.\n1 Ainok Bond-Kin 1 Angel of Condemnation 2 Witch Enchanter SIDEBOARD: 1 Containment Priest 3 Deafening Silence archidekt: Archidekt format.\n1x Agadeem's Awakening // Agadeem, the Undercrypt (znr) 90 [Resilience,Land] 1x Ancient Cornucopia (big) 16 [Maybeboard{noDeck}{noPrice},Mana Advantage] 1x Arachnogenesis (cmm) 647 [Maybeboard{noDeck}{noPrice},Mass Disruption] 1x Ashnod's Altar (ema) 218 *F* [Mana Advantage] 1x Assassin's Trophy (sld) 139 [Targeted Disruption] deckstats: Deckstats format.\n//Main 1 [2XM#310] Ash Barrens 1 Blinkmoth Nexus 1 Bloodstained Mire //Sideboard 1 [2XM#315] Darksteel Citadel //Maybeboard 1 [MID#159] Smoldering Egg // Ashmouth Dragon moxfield: Moxfield format.\n1 Ainok Bond-Kin (2X2) 5 1 Pegasus Guardian // Rescue the Foal (CLB) 36 2 Witch Enchanter // Witch-Blessed Meadow (MH3) 239 SIDEBOARD: 1 Containment Priest (M21) 13 1 Deafening Silence (MB2) 9 "},"title":"Magic: The Gathering"},"/tutorial/":{"data":{"":"\nEver wanted to make your own custom card game? How about making proxies for your favorite TCG?\nIt’s easy to make cards with a cutting machine and I can show you how!\nWhy use a cutting machine though?\nYou could do it by hand with a craft knife, a rotary cutter, or a paper guillotine, but it’s not easy. Some cards will be too tall, too fat, off angle, or off center. Plus, your body will be sore after the whole ordeal.\nJoin me in the 21st century where we have technology to solve our problems!\nWith the press of a button, a cutting machine can do all the hard work for you. Each card comes out exactly the same, perfectly sized and perfectly centered. It even does the rounded corners for you!\nI’ll go over everything you need to know to make your custom card games and proxies with a cutting machine including:\nEstimated costs of DIY cards List of equipment and materials Primer on Silhouette cutting machines Step by step cutting guide Troubleshooting When you’re ready, start with Estimated costs of DIY cards."},"title":"Tutorial"},"/tutorial/costs/":{"data":{"":"Let’s run the numbers.\nEach sheet produces 8 cards and each sheet is composed of:\na sheet of card stock, $10 for 150 sheets a lamination pouch, $20 for 200 pouches printer ink, $1 double-sided color printing ($10/150 sheets + $20/200 pouches) / 8 cards = $0.02 per card without printing\n($10/150 sheets + $20/200 pouches + $1 printing) / 8 cards = $0.15 per card with double-sided printing\nYou could make a deck of 100 custom cards for around $15!\nSure, there may be a significant upfront cost to get started but you can quickly recoup the cost, especially if you’re already accustomed to ordering custom cards online, paying for shipping, and sleeving up cards.\nThese businesses and they charge as much as $2 per card and $0.75 cents per card for bulk orders. That’s a farcry from $0.15 per card!\nThe most expensive purchase you’ll likely make is the cutting machine, which can cost $300.\nHowever, if you were considering ordering custom cards but decided to make them instead, you could recoup the cost of the printer in as few as 165 cards and as many as 500 cards, given the aforementioned pricing. To some, that may sound like a lot of cards, but to others, that’s negligible.\nAnd if you’re already a card-making aficionado, perhaps you wouldn’t save much monetarily but if you’re doing the work manually, you’d save time and wear on your body if you used a cutting machine. Perhaps, that’s worth it in and of itself."},"title":"Estimated Costs"},"/tutorial/guide/":{"data":{"":"","instructions#Instructions":"Set up environment Install Silhouette Studio.\nGit clone this repo. If you don’t know how, you can download the code here. Then unzip the code.\nIf you’re on macOS or Linux, open Terminal. If you’re on Windows, open PowerShell.\nNavigate to the code If you cloned the repo, you know what to do.\nIf you don’t, then you need to determine the path to your unzipped code is.\nFor example, if you unzipped it in your Downloads folder, then the following command will navigate you to the code.\ncd Downloads/silhouette-card-maker-testing-main/silhouette-card-maker-testing-main Check if Python is installed python --version If you don’t have Python, install it here. Be sure to check the box “Add Python to PATH” during installation.\nUpgrade pip (Python’s package manager) python -m pip install --upgrade pip Create and activate a Python virtual environment Create the virtual environment:\npython -m venv venv Activate the environment:\nmacOS/LinuxWindows Terminal (macOS/Linux):\n. venv/bin/activate PowerShell (Windows):\n.\\venv\\Scripts\\Activate.ps1 Note\nYou may see a security error. If you do, run the following, then try activating the environment again.\nSet-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope Process Install Python packages pip install -r requirements.txt Create the PDF First, put all your card front images into game/front. Then, put a card back image into game/back.\nNote\nWith permission, I’ve prepared an example game here. Zero Sumz is an abstract pattern-matching game.\nAdditionally, you can use a plugin\nGenerate the PDF with the following:\npython create_pdf.py You can find the PDF in game/output/game.pdf.\nTip\ncreate_pdf.py offers many options such as configuring paper and card size, supporting double-sided cards, and adding registration marks to the front sides. To learn more, see here.\nPrepare the sheets Print out the PDF and laminate the sheets.\nTip\nBecause cardstock is thicker than normal printer paper, you may need to set your laminator at a higher setting in order to get good lamination. If not, you may have cloudy lamination and delamination issues.\nCut the sheets Open the letter_standard_\u003cversion\u003e.studio3 cutting template in Silhouette Studio. Cutting templates can be found in the cutting_templates directory.\nPut a laminated sheet on the cutting mat. The side with the registration marks, the black square and “L\"s, should face up. Orient the sheet so that the black square is in the top left corner. Apply the laminated sheet onto the mat such that the top left corner of the card stock, not the lamination, is aligned with the top left corner of the grid on the mat.\nInsert the mat into the machine. The left edge of the mat should be aligned with the notch on the machine. Then, click the media load button on the machine.\nFinally, start the cutting job. The machine should begin the Print \u0026 Cut process and cut out the cards.\nFinish the cards Click the media eject button on the machine to remove the mat. Peel off the cards and excess.\nBecause the cutting process may cause the card edges to delaminate, put the cards through the laminator a second time.\nNow you’re ready to play with your cards!","next-steps#Next Steps":"As mentioned, the create_pdf.py script offers many configuration options. Try exploring some of these options to determining what works best for you. For example, a common use case is to only print the card fronts to save on ink. By default, the PDF generation puts the registration on the card backs, because if you play unsleeved, it’s important for the card backs to be consistent. However, if you want to override this behavior, you can use the --only_fronts option. create_pdf.py can also create double-sided cards, utilize different card and paper sizes, and more! See here for more information.\nIn regards to rerunning create_pdf.py in the future, you only need to do a few steps. Simply open Terminal or Powershell, navigate to the code, activate the virtual environment, and run create_pdf.py. You do not need to recreate the virtual environment or reinstall Python packages. However, this project will continue to grow and offer new features. If you want to get the latest updates, then you would have to get the latest code, create a new virtual environment, and reinstall Python packages.\nLastly, we have a Discord server! We’d love to see you there! You can find help if you’re struggling with the tutorial, you can see pictures of other people’s cards, and you talk to many different people who are all interested in creating board games and playing card games.\nThanks for reading and best of luck with your card cutting adventures!","prerequisites#Prerequisites":"Printer alignment If you plan on having card backs and/or if you plan on making double faced cards, then you need to ensure that printer can print with good front and back alignment. Otherwise, your card fronts and backs may have an offset.\nYour printer may have built-in tools for calibration and alignment adjustment. However, if you do not have access to your printer’s settings, I have provided a CLI tool that can add an offset to every other page in a provided PDF. You can use this offset to compensate to offset that your printer naturally provides. To learn more, see here.\nCutting settings Silhouette Studio provides a number of cutting settings, including blade force, cutting speed, passes, and blade depth.\nBefore starting the tutorial, determine the cutting settings that works best for you and the materials you want to cut.\nUnfortunately, there are no short cuts for this. You will need to do some experimentation on your own.\nI recommend creating a simple cutting template with Silhouette Studio. Set the blade force, cutting speed, and blade depth to something reasonable, but set passes to 1. You can have the machine recut again and again to determine the required passes. Prepare your cutting material, stick the material onto the cutting mat, insert the mat into the machine, and start the cutting job. Try different combinations of settings and repeat as necessary.\nThe following is a table of working settings from various testers. Do not use these settings blindly. Test conservatively and work up to the listed values. If not, you risk breaking your machine or cutting through your mat.\nMachine Blade Card stock Lamination Force Speed Passes Depth Cameo 5 Autoblade 65 lb 3 mil 30 30 3 7 Cameo 5 Autoblade 65 lbs/250 gsm 3 mil 30 20 4 7 Cameo 5 Autoblade 110 lb 3 mil 33 20 3 8 Cameo 5 Autoblade 110 lb/199 gsm 3 mil 33 30 4 10 Cameo 5 Autoblade 220 gsm 150 microns 30 26 4 8 Cameo 5 Autoblade 250 gsm 120 microns 40 10 8 10 Cameo 4 Plus Autoblade 110 lb 3 mil 30 30 3 5 Cameo 3 Deep-Cut Blade 110 lb 3 mil 33 5 5 19 "},"title":"Cutting Guide"},"/tutorial/primer/":{"data":{"":"The Silhouette Cameo is core to this process so it’s important to give some background so you’ll be better prepared to operate one.","silhouette-cameo-5#Silhouette Cameo 5":"The Cameo 5 is an electronically operated cutting machine. It’s similar to a laser cutter or a CNC machine. A computer controls the movement of the toolhead, which contains a small blade similar to a hobby knife, and the toolhead will cut the material. You can control various cutting parameters including the speed of the blade and the force of the blade, and you can cut various materials including paper, card stock, sticker paper, cardboard, vinyl, foam, fabric, and even leather. You can also purchase special add-on tools for foiling, embossing, and other purposes.\nAdditionally, the Cameo 5 supports Print \u0026 Cut. Print \u0026 Cut means the machine scans your printed page and automatically adjusts itself so that it’s able to cut precisely and consistently every time. You do not have to worry about aligning the sheets as the machine will make adjustments as needed. As long as the sheet is generally in the right area, the machine can compensate for placement and tilt. This is pivotal for card games because you want the backs of every card to be indistinguishable. More on Print \u0026 Cut later.\nYou only need to use a few buttons to operate a Cameo 5. First, there is the power button, which is on the right side of the machine. Second, there are the media load and media eject buttons on the bottom of the control panel. The buttons are used load and eject the cutting mat that carries your sheet. Lastly, there’s a repeat cutting job button that appears on the top of the control panel.","silhouette-studio#Silhouette Studio":"Silhouette Studio is the software used to create cutting designs and control the Cameo 5. It is easy to use and has simple visual UI. You can create a cutting template by drawing shapes on then screen and when you are ready, the machine will cut those shapes out. You can do fancier things like import an image (with a transparent background) and the software can cut out its outline, which is great for stickers and collages. However, I’ve included cutting templates in this tutorial so you won’t need to make your own unless you’re interested in making cards in a special size or shape.\nAs mentioned before, an important aspect of this process is Print \u0026 Cut. You need to enable it in a cutting template in order to reap the benefits. When you enable Print \u0026 Cut, Silhouette Studio will do two things, it’ll add registration marks to your cutting template, and when you print, it’ll have the machine scan for registration marks before cutting. The registration marks are what the cutting machine uses to determine the orientation of your paper and make the proper adjustments when cutting. However, the templates in this tutorial already have Print \u0026 Cut enabled so you will not need to change anything."},"title":"Silhouette Primer"},"/tutorial/supplies/":{"data":{"":"Disclosure: There are affiliate links below, meaning I may receive a small commission if you click through and make a purchase at no extra cost to you. I will only recommend products that I have tried and paid for myself and enjoyed using.","equipment#Equipment":" Cutting machine (Cameo 5) (coupon code: DIYBOARDGAMES) / Amazon alternative Thermal laminator Inkjet printer Printer cable (USB 2.0) Computer I recommend the Cameo 5 because it’s the cutting machine I use. However, if the cost is too high, you can consider purchasing the previous generation, the 4. The 4 Plus is still available on the official website and is significantly cheaper than the 5. Another affordable choice is the Portrait 4, but I think the versatility of the 4’s dual tool carriage and wide cutting area outweighs the slightly cheaper price of the Portrait 4. Please note that these other machines may use different cutting blades and cutting mats.\nI recommend this laminator for a number of reason. First, it’s not particularly expensive compared to others. Second, most laminators support only one or two hot settings (3 and 5 mil). This is the only reasonably priced laminator I’ve found with 4 hot settings: 3, 4, 5, and 6 mil. Because laminators are built for printer paper and not card stock, it’s helpful to have these additional settings to ensure lamination quality. Lastly, this laminator is wide, which makes it easy to feed sheets and finish cards.\nIf you plan on purchasing a printer, consider purchasing an inkjet printer instead of a laser printer. The laser toner affects the lamination, causing it to easily detach. It’s possible to use a laser printer but you’ll have to be gentle. Also consider purchasing a duplex printer. It’s possible to use a simplex printer but you may not have good front and back alignment. Lastly, I think this is a good place to splurge on. First, you want to enjoy the cards, so if you’re using a subpar printer, you may eventually regret it. Second, poor print quality can affect the Cameo’s registration.\nThere’s nothing special about this printer cable but it’s cheap and it’s also a two pack! The Cameo 5 does not come with a cable because it supports Bluetooth. However, the Bluetooth connection is spotty so I recommend interfacing directly with a cable.","materials#Materials":" Printer ink Card stock (110 lb) Thermal lamination pouches (3 mil) The card stock I use is 110 lb but it may be too thick for some printers. Please refer to your printer’s manual. If 110 lb is too thick, 60 lb also works well. I’ve also heard amazing things about double-sided glossy photo card stock, but it only works with dye-based inkjet printers, so I will not recommend it. Regardless, any decent card stock will work.\nSimilarly, any decent lamination pouches will work. I’ve also heard good things about matte lamination pouches but they are not as common and also more expensive.\nOptional\nExtra cutting mats (12 x 12 in) (coupon code: DIYBOARDGAMES) / Amazon alternative Extra cutting blades (AutoBlade) (coupon code: DIYBOARDGAMES) / Amazon alternative Hobby knife with cutting mat You’ll want to pick up extra cutting mats. Cutting mats are sticky and they hold the sheet as its being cut. Over time, they’ll lose their stickiness and must be replaced. Additionally, it’s nice to have extra mats so you can prep one as another one is being cut. Each mat should last for a few hundred cards or a few dozen sheets as long as you take care of them.\nThe Cameo 5 can cut a lot of materials including tough materials like corrugated paper, chipboard, and wood. However, if you’re only cutting cards, your blade should last a long time. At the same time, if you’re new to these machines, you could accidentally break the blade due to improper set up. Consider buying an extra as a back up.\nA hobby knife and a (non-sticky) cutting mat can come in handy. Occasionally, the Cameo will leave you a straggler card where it’s not completely detached. You can use the hobby knife to finish the cut."},"title":"Supply List"},"/tutorial/troubleshooting/":{"data":{"":"","are-laminated-cards-similar-to-mass-produced-cards#Are laminated cards similar to mass produced cards?":"","can-i-make-double-sided-cards#Can I make double-sided cards?":"","do-i-need-to-laminate-my-cards#Do I need to laminate my cards?":"","do-you-have-printer-recommendations#Do you have printer recommendations?":"","why-are-my-card-delaminating#Why are my card delaminating?":"","why-are-my-cards-offset#Why are my cards offset?":"If either the fronts or the backs are offset, then there’s most likely an issue with your printer alignment. Refer to your printer’s instruction manual and try to recalibrate it. If there’s no way to change the printer’s settings, try using offset.py to compensate for the offset.\nIf both the fronts and backs are offset, then there may be an issue with registraion. Ensure that you are printing with the right scale and cutting with the right cutting template, and ensure that there’s nothing that can interfere with the registration process.","why-are-my-cards-the-wrong-size#Why are my cards the wrong size?":"Some printers secretly add an offset to your prints, even if they are set to 100% scale or actual size. You may need to do some manual calibration in order to have your cards print and be cut out at the right size.","why-are-my-cards-wavy#Why are my cards wavy?":"","why-did-my-cards-come-out-diagonally#Why did my cards come out diagonally?":"As mentioned in Why is the registration failing?, your machine may occasionally scan the bottom left card as it’s searching for the bottom left L during registration. When this happens, the machine may either stop and complain, or continue and start cutting cards diagonally. To fix this, try being more careful when you place the sheet and the mat, or employ the Post-It note trick.","why-didnt-my-machine-cut-all-the-way-through#Why didn\u0026rsquo;t my machine cut all the way through?":"Do I need to laminate my cards? No. Lamination provides a lot of advantages like durability, water resistance, shuffleability, and card feel, but it’s not necessary. However, if you’re planning on using a cutting machine to help with another workflow that doesn’t require lamination, you don’t need to do so.\nAre laminated cards similar to mass produced cards? It depends on the weight of your card stock and the thickness of your lamination, but from personal experience with 110 lb card stock and 3 mil lamination, I think it’s very similar to mass produced cards.\nIf I had to say anything, I would say this combination is only marginally thicker than mass produced card but if you plan on using card sleeves and playing with a mix of both, I would say it’s almost indistinguishable.\nCan I make double-sided cards? Yes, the create_pdf.py script has many other features including laying out double-sided cards. To see the full documentation, please see here.\nLong story short, put the fronts in game/front and the backs in game/double_sided. The names of the files must match for each pair. Then, simply run create_pdf.py as usual.\nDo you have printer recommendations? No, but I can give you give you some ideas on what you should look for.\nFirst, I do not recommend getting a laser printer. The laser toner affects the lamination, causing it to easily delaminate. It can work, but you may have issues with delamination during cutting and while removing cards from the cutting mat.\nSecondly, determine what kind of custom cards you’d like to make. Do you want to make double-sided laminated cardstock cards like mine? Perhaps single sided is suitable for your situation? Perhaps you’d like to cut out regular printer paper or sticker paper and use an alternative way of making custom cards.\nNot all printers can handle card stock, and even if it can handle card stock, it may not be able to handle thicker card stock like 110 lb. Additionally, if you plan on making double-sided cards, getting a printer that can do duplex printing would be ideal. If you have a simplex printer, you can feed the printed pages back into printer to achieve double-sided printing, but you could have issues with alignment.\nInvest in a good printer because you want the cards to look nice as you play with them and because poor quality printing can also affect the Cameo’s Print \u0026 Play.\nWhy are my card delaminating? Are you using a laser printer? The laser toner sticks to the lamination, which prevents the lamination from sticking to the paper. Laser printing can work with this process, but you’ll have to be gentler with the cards while cutting and while playing.\nTry laminating a second time or laminating at a higher setting before cutting. Because card stock is thicker than printer paper, you need to use more heat to get proper lamination. Additionally, this will help to clear up any cloudiness in your lamination, making your cards look better in the end.\nWhy are my cards wavy? Set your laminator to a lower setting. It’s adding too much heat, causing the lamination to contract more than needed.\nAlternatively, immediately put the laminated sheets under a heavy book to let them cool down flat.\nWhy is the registration failing? Ensure that there is nothing blocking the registration sensor.\nEnsure that the sheets are generated with the right template and printed with 100% scale.\nEnsure the sheet is placed correctly on the mat and the mat is placed correctly in the machine. Otherwise, the machine can struggle to scan the registration marks. The top left corner of the paper, not the lamination, should align with the top left corner of the grid on the mat. The left edge of the mat should align with the notch on the machine.\nTry playing around with the lighting. If the room is too bright or too dark, the machine may have issues. Try shining a light at the sensor to provide more lighting. Try closing the cover as well.\nIn my own experience, the registration can occasionally fail as the machine is scanning the bottom left L. This occurs when the machine unintentionally scans the bottom left card as it’s searching for the bottom left L. If you have this issue, try covering the bottom left card with a Post-It note during registration and removing it before cutting.\nIf none of the previous tips worked, the issue may be your choice of paper, lamination, or printing.\nWhy didn’t my machine cut all the way through? Did you configure your cutting settings? The cutting templates do not contain cutting settings. You must add your settings manually. To learn more, see here.\nIf you configured you cutting settings, then try adjusting your settings by adding more force or more passes. If you are still having issues, try using a new blade and/or mat.","why-is-my-machine-cutting-in-the-wrong-place#Why is my machine cutting in the wrong place?":"Make sure you’re using the right cutting template. Each sheet should be labeled with the cutting template it’s associated with, for example “letter_bridge_v1”.","why-is-the-registration-failing#Why is the registration failing?":""},"title":"Troubleshooting"}}